Autodesk.Revit.DB.PDFExportOptions.SetPdfParameterProvider(Autodesk.Revit.DB.IPDFParametersProvider)
Set PdfParameterProvider
pParameterProvider:
Set to null to remove ParameterProvider
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.GetPdfParameterProvider
Get PdfParameterProvider
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.StopOnError
Whether export process should stop when a view fails to export
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.ReplaceHalftoneWithThinLines
Whether to replace halftone with thin lines.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.MaskCoincidentLines
Whether to mask coincident lines.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.HideScopeBoxes
Whether to hide scope boxes.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.HideUnreferencedViewTags
Whether to hide unreferenced view tags.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.HideRefPlanesOrWorkPlanes
Whether to hide reference/work planes.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.HideCropBoundaries
Whether to hide crop boundaries.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.ColorDepth
Color depth of either black/white, gray scale or color.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.RasterQuality
The preferred raster quality (DPI).
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.ZoomPercentage
Percentage of the zoom for the view.
Remarks:
This property would be ignored if the ZoomType is FitToPage
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.ZoomType
Zoom type of either fit to page or on a specific percentage.
Remarks:
This property would be ignored if the PaperFormat is Default.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.AlwaysUseRaster
If true completely use raster processing for graphics, otherwise use vector processing as much as possible.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.PaperFormat
Standard paper format.
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.PaperOrientation
Paper orientation - Portrait/Landscape
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.Naming
Naming rule to generate the file name of the PDF files. Not the name itself.
Use <...> for placeholder.
Example Input: <ProjectNumber>-<SheetNumber>-<SheetName>-<ExportDate>
Example Output: 1-1-AutodeskSheet-05192020
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions.#ctor
Create a default options object
Since:
2021.1

Autodesk.Revit.DB.PDFExportOptions
Options for PDF export
Since:
2021.1